#+TITLE: OpenCV 的介绍
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2019-01-25 Fri>
#+TAGS: opencv


*** 读取图片

opencv 的彩色的图片采用 **BGR** 的排列方式，和我们通常使用 **RGB** 的方式有所不同。

#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :exports both :session default :results output pp
  img = cv.imread(lenna)
  print('img type = {}'.format(type(img)))
  print('img.shape = {}'.format(img.shape))
  gray_image = cv.imread(lenna, cv.IMREAD_GRAYSCALE)
  print('gray_image.shape = {}'.format(gray_image.shape))
#+END_SRC

#+RESULTS:
: img type = <class 'numpy.ndarray'>
: img.shape = (512, 512, 3)
: gray_image.shape = (512, 512)

*** 像素操作

#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :exports both :session default :results output pp
  img = cv.imread(lenna)
  print('px[4, 5] = {}'.format(img[4, 5]))
  print('blut px[4, 5, 0] = {}'.format(img[4, 5, 0]))
#+END_SRC

#+RESULTS:
: px[4, 5] = [116 129 226]
: blut px[4, 5, 0] = 116

*** 相片属性

#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :exports both :session default :results output pp
  img = cv.imread(lenna)
  print('shape = {}, size = {}, dtype = {}'.format(img.shape, img.size, img.dtype))
#+END_SRC

#+RESULTS:
: shape = (512, 512, 3), size = 786432, dtype = uint8

*** 图片相加
#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :exports both :session default :results output pp
  x = np.uint8([250])
  y = np.uint8([10])
  print('cv.add(x,y) = {}'.format(cv.add(x, y))) # 250+10 = 260 => 255
  print('x + y = {}'.format(x + y))              # 250+10 = 260 % 256 => 4
#+END_SRC

#+RESULTS:
: cv.add(x,y) = [[255]]
: x + y = [4]

